mmercalde/termite-rf-gun/panasonic_dual_igbt_esp32s3/panasonic_dual_igbt_esp32s3.ino
/* ============================================================================
 *  panasonic_dual_igbt_esp32s3.ino  -  Panasonic 2-IGBT inverter driver
 *  ESP32-S3 Dev Module · core 2.x/3.x · 4MB · PSRAM off · USB CDC On Boot
 * ----------------------------------------------------------------------------
 *  TARGET BOARD: Panasonic F6645M301GP / "M3GP" 2-IGBT inverter (240V)
 *  ORIGINAL IGBTs (obsolete): Toshiba GT50J327 big + GT35J321 small
 *  REPLACEMENT IGBTs:         Infineon IHW40N120R5 big + IHW30N120R5 small
 *                             (TRENCHSTOP RC-H5, 1200V, monolithic body diode)
 *
 *  ======================================================================
 *  MAJOR REWRITE 2026-05-30 — incorporates VK3HZ canonical findings:
 *
 *  1) PIN 3 (orange) is the STATUS INPUT from the inverter, NOT a feedback
 *     pin we drive. The inverter emits a 110Hz/50% square wave on this line
 *     when the magnetron is warm and drawing current. We READ it, not write.
 *
 *  2) STARTUP — follows VK3HZ_FINDINGS.md (230V board). Drive the run duty
 *     (default 75% HIGH @ 222Hz = VK3HZ P100) from cycle one, no soft-start;
 *     the inverter's own current loop handles inrush. Watch PIN_STATUS for the
 *     110Hz signal, declare RUN once seen, ABORT if it never appears.
 *
 *  3) RUN DUTY = 75%, CAP 75% (VK3HZ: P100 = 75%, >75% over-drives). NOTE the
 *     ~85% figure from our 120V personal-oven capture does NOT apply here:
 *     duty isn't voltage-portable on a constant-power inverter (120V needs more
 *     on-time, 240V less). 222Hz/polarity/no-soft-start transfer; duty doesn't.
 *
 *  4) NO MORE sig2 OUTPUT. The previous firmware drove GPIO5 with a 110Hz
 *     emulation pattern, which fought the inverter's own status signal on
 *     the same line. Now GPIO5 is INPUT only.
 *
 *  HARDWARE CHANGE REQUIRED for safe status reading:
 *  --------------------------------------------------
 *  The board pulls CN701 pin 3 up to 5V via its internal pull-up. With only
 *  a 1k series resistor (existing), GPIO5 would see ~5V on the high state,
 *  exceeding ESP32-S3's 3.3V max input.
 *
 *  Add a 2.2k pulldown from GPIO5 to GND to form a voltage divider:
 *
 *       5V (board pull-up via ~1-2k internal)
 *         |
 *      pin3 -------- 1k ------- GPIO5 ----+
 *                                         |
 *                                        2.2k
 *                                         |
 *                                        GND
 *
 *  GPIO5 voltage when board high:  ~3.0V  (safe)
 *  GPIO5 voltage when inverter sinks pin3 low: ~0V (safe)
 *
 *  If you DO NOT add the 2.2k pulldown, the status read may be unreliable
 *  and could damage the GPIO over time. The firmware still runs — abort
 *  detection still works on timeout — but it won't see the actual status
 *  signal correctly until the divider is in place.
 *
 *  ======================================================================
 *
 *  WIRING (updated):
 *    GPIO4 = PWM command out (push-pull TTL 3.3V) -> CN701 pin 1 (YELLOW)
 *    GPIO5 = STATUS INPUT from inverter (via 1k + 2.2k divider, see above)
 *              -> CN701 pin 3 (ORANGE)
 *    GND                                          -> CN701 pin 2 (BROWN)
 *    GPIO7 = zero-cross in (monitor only)
 *    GPIO6 = capture tap (divider) for 'log' mode
 *    GPIO1 = Button1 ON/OFF ; GPIO2 = Button2 power step
 *
 *  CONSOLE (115200):
 *    on / off          start (drive run duty, status-gated) / stop
 *    pulse <ms>        timed burst (1..30000ms at run duty, auto-stop). 'off' aborts.
 *    p <10..75>        set RUN duty % (default 75 = VK3HZ P100; cap 75)
 *    f <hz>            set command frequency (default 222)
 *    tmo <ms>          set status-timeout ms (default 5000)
 *    force             ignore status — open-loop run (proven single-IGBT path)
 *    nostatus          skip status detection, treat strike as complete
 *    statusinfo        print live status-signal edge rate
 *    log / logdump     capture mode on GPIO6
 *    zc / status / ?
 * ==========================================================================*/

#include "soc/gpio_struct.h"
#include <WiFi.h>
#include <WebServer.h>
#include <math.h>

// ---- WiFi AP (self-hosted, no router — for off-grid bench use) ----
// Join SSID 'TermiteRF' (pass 'magnetron'), browse to http://192.168.4.1/
// The PWM runs on a hardware-timer ISR, INDEPENDENT of WiFi — so a dropped
// web packet (e.g. RF hiccup at strike) does NOT drop the command to the
// inverter. The web link only sets parameters and start/stop.
const char* AP_SSID = "TermiteRF";
const char* AP_PASS = "magnetron";       // must be >= 8 chars
WebServer   server(80);

// ---- web / remote-control state ----
bool     webControlled    = false;       // current run was started from the web UI
uint32_t lastWebContactMs = 0;           // updated each /state poll (keep-alive)
bool     deadmanOn        = false;        // auto-off if web contact lost (OFF by default
                                          // so a WiFi hiccup at strike can't abort a run)
uint32_t deadmanSec       = 15;           // grace period before deadman auto-off
uint32_t maxRunSec        = 60;           // HARD cap: web runs auto-off after this
uint32_t runStartMs       = 0;            // when the current run began
volatile uint32_t statusHzX10 = 0;        // measured status-line edge rate x10 (feedback)

constexpr int PIN_PWM     = 4;   // command out -> CN701 pin1 (YELLOW)
constexpr int PIN_STATUS  = 5;   // status IN  <- CN701 pin3 (ORANGE), via divider
constexpr int PIN_ZC      = 7;   // zero-cross monitor
constexpr int PIN_BTN_ONOFF = 1;
constexpr int PIN_BTN_POWER = 2;
constexpr int PIN_LOG     = 6;   // capture tap

constexpr bool INVERT_CMD = false;

constexpr uint32_t TICKS = 200;        // 0.5% duty resolution
uint32_t cmdFreqHz = 222;              // 222Hz command — COMMON to 120V and 240V boards
int      curDuty   = 75;
bool     running   = false;

// ---- VERIFIED startup parameters (per VK3HZ_FINDINGS.md) ----
// VK3HZ characterized a Panasonic NN-S550WF — a 230V (Australian) board, so
// his duty table is the VOLTAGE-MATCHED reference for our 240V F6645 boards.
//
// What transfers from our own 120V bench capture (captures/oven_run1.txt) is
// ARCHITECTURE ONLY, not duty magnitude:
//   * 222 Hz command period (4509us)         -> COMMON to both voltages
//   * active-high polarity, more HIGH = power -> INVERT_CMD = false
//   * NO soft-start ramp; DPC commands the run duty from cycle one and the
//     inverter's own current loop handles magnetron inrush
// Duty does NOT transfer: constant-power means a 120V board needs more on-time
// (~85%) to reach full power, a 240V board reaches it at LESS on-time. Using
// the 120V 85% on a 240V board would be genuine over-drive.
//
// So duty magnitudes come from VK3HZ's 230V table:
//   P40=33  P50=33  P60=40  P70=55  P80=62  P90=69  P100=75   (% HIGH duty)
//   "P100 = 75%. Anything above 75% is over-driving the inverter."
//
// Startup (kept): drive the run duty from cycle one, watch the 110Hz status
// line, declare RUN only once the magnetron is oscillating, ABORT if status
// never appears (no-load protection for the constant-power loop). For P50+
// (our regime) VK3HZ shows continuous drive at the run value — no separate
// warmup duty. We never drive the status line.
uint32_t statusTimeoutMs  = 5000;      // 5s to see status before aborting

constexpr int DUTY_MIN   = 10;
constexpr int DUTY_MAX   = 75;         // VK3HZ: P100 = 75%, >75% is over-driving

// RUN power steps (% HIGH duty) = VK3HZ continuous P-levels P40..P100.
const int RUN_STEPS[] = {33, 40, 55, 62, 69, 75};
const int RUN_COUNT = sizeof(RUN_STEPS)/sizeof(RUN_STEPS[0]);
int runIdx = 5;                        // DEFAULT 75% == VK3HZ P100
int curRunDuty = 75;

