mmercalde/termite-rf-gun/panasonic_dual_igbt_esp32s3/panasonic_dual_igbt_esp32s3.ino
const uint32_t FREQ_LIST[] = {110, 150, 165, 180, 200, 222, 233, 250, 280, 300};
const int FREQ_COUNT = sizeof(FREQ_LIST)/sizeof(FREQ_LIST[0]);
int freqIdx = 5;                       // 222Hz

// Override flags
bool forceMode    = false;             // 'force' = ignore status, open-loop run
bool statusBypass = false;             // 'nostatus' = skip status detection

// ---- ISR PWM ----
hw_timer_t* pwmTimer = nullptr;
volatile uint32_t tickCounter = 0, sinkTicks = 0;
volatile uint32_t periodTicks = TICKS;   // ticks per command period (200 normally;
                                         // 167 in captured-profile playback)
volatile bool drvEnabled = false;

void IRAM_ATTR onPwmTick() {
    if (!drvEnabled) { GPIO.out_w1tc = (1u<<PIN_PWM); return; }
    tickCounter++;
    if (tickCounter >= periodTicks) tickCounter = 0;
    bool on = (tickCounter < sinkTicks);
    if (INVERT_CMD) on = !on;
    if (on) GPIO.out_w1ts = (1u<<PIN_PWM);
    else    GPIO.out_w1tc = (1u<<PIN_PWM);
}

// Start the timer with an EXPLICIT per-tick microsecond value (no freq truncation).
// Used by captured-profile playback so the period is exact (167 ticks x 27us = 4509us).
void timerStartUs(uint32_t us) {
    if(us<1) us=1;
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    if(!pwmTimer){pwmTimer=timerBegin(1000000);timerAttachInterrupt(pwmTimer,&onPwmTick);}
    timerStop(pwmTimer);timerWrite(pwmTimer,0);
    timerAlarm(pwmTimer,us,true,0);timerStart(pwmTimer);
#else
    if(!pwmTimer){pwmTimer=timerBegin(0,80,true);timerAttachInterrupt(pwmTimer,&onPwmTick,true);}
    timerAlarmWrite(pwmTimer,us,true);timerAlarmEnable(pwmTimer);
#endif
}

void timerStart(uint32_t fhz) {
    uint32_t f=fhz; if(f<1)f=1; if(f>5000)f=5000;
    uint32_t us=1000000UL/(f*TICKS); if(us<5)us=5;
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    if(!pwmTimer){pwmTimer=timerBegin(1000000);timerAttachInterrupt(pwmTimer,&onPwmTick);}
    timerStop(pwmTimer);timerWrite(pwmTimer,0);
    timerAlarm(pwmTimer,us,true,0);timerStart(pwmTimer);
#else
    if(!pwmTimer){pwmTimer=timerBegin(0,80,true);timerAttachInterrupt(pwmTimer,&onPwmTick,true);}
    timerAlarmWrite(pwmTimer,us,true);timerAlarmEnable(pwmTimer);
#endif
}

// ---- zero-cross capture (monitor only) ----
volatile uint32_t zcLastUs = 0, zcPeriodUs = 0;
volatile uint32_t zcAccum = 0;
volatile uint8_t  zcEdgeCount = 0;
volatile bool zcSeen = false;
constexpr uint32_t ZC_LOCKOUT_US = 4000;
void IRAM_ATTR onZeroCross() {
    uint32_t now = micros();
    uint32_t dt = now - zcLastUs;
    if (zcLastUs && dt < ZC_LOCKOUT_US) return;
    if (zcLastUs) {
        zcAccum += dt;
        zcEdgeCount++;
        if (zcEdgeCount >= 2) {
            zcPeriodUs = zcAccum;
            zcAccum = 0;
            zcEdgeCount = 0;
        }
    }
    zcLastUs = now; zcSeen = true;
}

// ---- STATUS signal detection (110Hz square wave from inverter) ----
// Count edges on PIN_STATUS. At 110Hz/50% we expect 220 edges/second.
// Over a 200ms window: 44 expected. If we see >= STATUS_EDGES_MIN edges,
// signal is present (magnetron warm and oscillating).
volatile uint32_t statusEdgeCount = 0;
constexpr uint32_t STATUS_WINDOW_MS = 200;
constexpr uint32_t STATUS_EDGES_MIN = 30;  // ~75Hz min (50% margin below 110Hz)

void IRAM_ATTR onStatusEdge() {
    statusEdgeCount++;
}

// Sample the edge counter over a window, return true if signal present.
// Non-blocking: pass elapsed window in ms, returns true if last window
// crossed STATUS_EDGES_MIN. Reset internal accumulator each call.
bool statusSignalLive() {
    static uint32_t lastSampleMs = 0;
    static uint32_t lastCount = 0;
    uint32_t now = millis();
    if (now - lastSampleMs < STATUS_WINDOW_MS) return false;  // not yet
    uint32_t cur = statusEdgeCount;
    uint32_t delta = cur - lastCount;
    lastCount = cur;
    lastSampleMs = now;
    return delta >= STATUS_EDGES_MIN;
}

// Reset the status sampler (call when starting a new bring-up sequence)
void statusSamplerReset() {
    noInterrupts();
    statusEdgeCount = 0;
    interrupts();
}

// ---- duty / command primitives ----
void setDuty(int d){
    if(d<DUTY_MIN) d=DUTY_MIN;
    if(d>DUTY_MAX) d=DUTY_MAX;
    curDuty=d;
    sinkTicks=(uint32_t)d*periodTicks/100;
}

// ---- CLOSED-LOOP STARTUP (per VK3HZ doc + bench scope) ----
// Documented Panasonic behaviour: drive 222Hz at the STARTUP duty (the "50% power"
// level = ~33% duty) UNTIL the 110Hz Status signal appears (magnetron drawing
// current), THEN set the RUN duty. Status idles HIGH (5V) and starts TOGGLING at
// 110Hz when the tube fires — so detection = "110Hz toggling appeared", not a
// level. Cold tubes: if no status within the attempt window, restart and retry
// (covers the ~12s cold-start budget seen on video).
constexpr uint32_t PB_PERIOD = 167;      // ticks/period -> 0.6% duty resolution
float    pbFreqHz   = 222.0f;            // command frequency (constant; duty=power)
float    pbWarmPct  = 33.0f;             // STARTUP duty (VK3HZ 50%-power level; raise for 120V)
float    pbRunPct   = 75.0f;             // RUN duty after status (VK3HZ 100%-power = 75%; raise for 120V)
uint32_t pbWarmupMs = 3000;              // attempt window: drive startup duty this long awaiting status
uint32_t pbRestartMs= 400;               // command-off gap between failed attempts
int      pbMaxRetry = 6;                 // restart cycles before just holding startup duty
bool     playbackActive = false;
bool     pbInRun = false;                // true once status seen and at RUN duty
uint32_t pbStartMs = 0;

// sequence state machine
enum SeqState { SEQ_OFF, SEQ_STARTUP, SEQ_RESTART, SEQ_RUN, SEQ_HOLD };
SeqState seqState = SEQ_OFF;
uint32_t seqMs = 0;       // time current state entered
int      seqRetry = 0;
bool     statusEverSeen = false;

// tick period (us) for the chosen frequency, and HIGH-ticks for a duty %
uint32_t pbTickUs(){
    float f = pbFreqHz; if(f<50) f=50; if(f>400) f=400;
    long u = lroundf(1000000.0f/(f*PB_PERIOD)); if(u<1) u=1; return (uint32_t)u;
}
uint32_t pbTicks(float pct){
    if(pct<10) pct=10; if(pct>95) pct=95;          // clamp; never 0 or 100% (no off-time)
    long t = lroundf(pct/100.0f*PB_PERIOD);
    if(t<1) t=1; if(t>=(long)PB_PERIOD) t=PB_PERIOD-1; return (uint32_t)t;
}

// status present = 110Hz toggling detected (band rejects idle=0Hz and HF noise)
bool statusPresent(){ return (statusHzX10 >= 600 && statusHzX10 <= 1700); }  // 60-170Hz

void cmdOff(){
    drvEnabled=false; sinkTicks=0;
    playbackActive=false; pbInRun=false;
    seqState=SEQ_OFF;
    periodTicks=TICKS;                   // restore normal duty resolution
    GPIO.out_w1tc=(1u<<PIN_PWM);
}

