mmercalde/termite-rf-gun/panasonic_dual_igbt_esp32s3/panasonic_dual_igbt_esp32s3.ino
void cmdOn(){
    tickCounter=0; drvEnabled=true;
    timerStart(cmdFreqHz);
}

// drive 222Hz at a given duty (used by the sequence)
void seqDrive(float duty){
    periodTicks = PB_PERIOD;
    sinkTicks   = pbTicks(duty);
    curDuty     = (int)lroundf(duty);
    tickCounter = 0; drvEnabled = true;
    timerStartUs(pbTickUs());
}

bool startPlayback(){
    // begin closed-loop startup: drive startup duty, watch for 110Hz status
    seqDrive(pbWarmPct);
    playbackActive = true; pbInRun = false;
    seqState = SEQ_STARTUP; seqMs = millis();
    seqRetry = 0; statusEverSeen = false;
    running = true; runStartMs = millis();
    Serial.printf("[SEQ] %.0fHz startup %.0f%% -> watch 110Hz status -> run %.0f%%. "
                  "attempt %lums, restart %lums, retries %d. 'off' to stop.\n",
                  pbFreqHz, pbWarmPct, pbRunPct,
                  (unsigned long)pbWarmupMs,(unsigned long)pbRestartMs, pbMaxRetry);
    return true;
}

// non-blocking sequence tick, called from loop()
void seqTick(){
    if(seqState==SEQ_OFF) return;
    uint32_t now = millis();
    bool present = statusPresent();
    switch(seqState){
      case SEQ_STARTUP:
        if(present){                                   // tube struck -> go to RUN
            statusEverSeen=true; seqDrive(pbRunPct);
            pbInRun=true; seqState=SEQ_RUN; seqMs=now;
            Serial.printf("[SEQ] 110Hz status SEEN -> RUN %.0f%%\n", pbRunPct);
        } else if(now-seqMs > pbWarmupMs){             // no status in window
            if(seqRetry < pbMaxRetry){
                seqRetry++;
                drvEnabled=false; GPIO.out_w1tc=(1u<<PIN_PWM);  // command off (restart)
                seqState=SEQ_RESTART; seqMs=now;
                Serial.printf("[SEQ] no status, restart #%d/%d\n", seqRetry, pbMaxRetry);
            } else {
                seqState=SEQ_HOLD; seqMs=now;          // keep driving startup, keep watching
                Serial.println("[SEQ] retries done — holding startup duty, still watching status");
            }
        }
        break;
      case SEQ_RESTART:
        if(now-seqMs > pbRestartMs){                   // re-arm startup drive
            seqDrive(pbWarmPct); seqState=SEQ_STARTUP; seqMs=now;
        }
        break;
      case SEQ_HOLD:                                   // exhausted retries; still watch
        if(present){ statusEverSeen=true; seqDrive(pbRunPct); pbInRun=true;
                     seqState=SEQ_RUN; seqMs=now;
                     Serial.printf("[SEQ] late 110Hz status -> RUN %.0f%%\n", pbRunPct); }
        break;
      case SEQ_RUN:
        // driving run duty; if status disappears for >1.5s, note it (tube dropped)
        if(!present && (now-seqMs)>1500){
            Serial.println("[SEQ] status lost during RUN (tube dropped?)");
            seqState=SEQ_STARTUP; seqMs=now; seqRetry=0; pbInRun=false; seqDrive(pbWarmPct);
        }
        break;
      default: break;
    }
}

// ============================================================================
//  STARTUP STATE MACHINE (VERIFIED — no soft-start)
//  Phase A: STRIKE — drive curRunDuty (default 75% = VK3HZ P100) from cycle
//                    PIN_STATUS for the 110Hz signal (magnetron drawing current)
//  Phase B: RUN    — status seen → hold curRunDuty until stopRun
//  Phase C: ABORT  — no status within timeout → stop, report
//
//  Bypasses:
//    forceMode    — skip status detection entirely, run open-loop. This is the
//                   proven single-IGBT path; use it if the status divider on
//                   GPIO5 isn't wired (e.g. ORANGE tied to GND through 1k).
//    statusBypass — treat strike as immediately complete (divider-debug only)
// ============================================================================

// Returns true if startup succeeded (in RUN), false if aborted.
// Blocking — caller decides when to return.
bool startRun(){
    cmdFreqHz = FREQ_LIST[freqIdx];

    if(forceMode){
        Serial.println("[ON] FORCE mode: open-loop, no status check");
        setDuty(curRunDuty);
        cmdOn();
        running = true;
        return true;
    }

    // Phase A: STRIKE — drive the run duty from cycle one (NO soft-start, per
    // captured oven command). Inverter's own current loop handles inrush. We
    // hold this same duty and wait for the 110Hz status signal to confirm the
    // magnetron has struck and is drawing current.
    Serial.printf("[ON] driving %d%% @ %luHz from cycle one, waiting up to %lums for status...\n",
                  curRunDuty, (unsigned long)cmdFreqHz, (unsigned long)statusTimeoutMs);
    statusSamplerReset();
    setDuty(curRunDuty);
    cmdOn();
    running = true;

    if(statusBypass){
        Serial.println("[ON] NOSTATUS bypass: skipping status detection, treating as RUN");
        Serial.printf("[RUN] %d%% @ %luHz (status bypassed)\n",
                      curRunDuty, (unsigned long)cmdFreqHz);
        return true;
    }

    // Poll for status signal
    uint32_t deadline = millis() + statusTimeoutMs;
    bool statusFound = false;
    while(running && millis() < deadline){
        if(statusSignalLive()){
            statusFound = true;
            break;
        }
        delay(5);
    }

    if(!statusFound){
        // Phase C: ABORT
        cmdOff();
        running = false;
        Serial.printf("[ABORT] no status signal in %lums.\n",
                      (unsigned long)statusTimeoutMs);
        Serial.println("[ABORT] check: magnetron present? mains 240V? wiring? divider on GPIO5?");
        Serial.println("[ABORT] to bypass status check: 'nostatus' (debug) or 'force' (open-loop, risky)");
        return false;
    }

    // Phase B: RUN — status confirms the magnetron struck. We're already at
    // run duty (drove it from cycle one), so just confirm and hold.
    uint32_t strikeMs = statusTimeoutMs - (deadline - millis());
    Serial.printf("[STATUS LIVE] magnetron oscillating after %lums\n",
                  (unsigned long)strikeMs);
    Serial.printf("[RUN] %d%% @ %luHz\n", curRunDuty, (unsigned long)cmdFreqHz);
    return true;
}

void stopRun(){
    cmdOff();
    running = false;
    webControlled = false;
    Serial.println("[OFF] command=0.");
}

