mmercalde/termite-rf-gun/panasonic_dual_igbt_esp32s3/panasonic_dual_igbt_esp32s3.ino
// Forward decl + serial buffer (declared early so pulseRun() can service serial)
String buf;
void handle(String c);

// ---- TIMED PULSE — bounded burst for bring-up ----
constexpr uint32_t PULSE_MAX_MS = 30000;

void pulseRun(uint32_t ms){
    if(ms < 1) ms = 1;
    if(ms > PULSE_MAX_MS){
        ms = PULSE_MAX_MS;
        Serial.printf("[PULSE] clamped to max %lums\n",(unsigned long)PULSE_MAX_MS);
    }
    Serial.printf("[PULSE] %lums at run duty after warmup. 'off' aborts.\n",
                  (unsigned long)ms);
    if(!startRun()){
        Serial.println("[PULSE] aborted during warmup, no fire");
        return;
    }
    uint32_t deadline = millis() + ms;
    while(running && (int32_t)(deadline - millis()) > 0){
        while(Serial.available()){
            char ch=(char)Serial.read();
            if(ch=='\n'||ch=='\r'){ if(buf.length()){handle(buf);buf="";} }
            else if(buf.length()<32) buf+=ch;
        }
        delay(5);
    }
    if(running){
        Serial.printf("[PULSE] %lums elapsed -> auto-stop\n",(unsigned long)ms);
        stopRun();
    } else {
        Serial.println("[PULSE] aborted before deadline");
    }
}

// ============================================================================
//  COMMAND-LINE LOGGER (capture mode for GPIO6)
// ============================================================================
#define LOG_MAXEDGES 8000
#define BOOT_AUTOLOG 0
constexpr uint32_t LOG_WINDOW_MS = 10000;

volatile uint32_t logT[LOG_MAXEDGES];
volatile uint8_t  logL[LOG_MAXEDGES];
volatile uint32_t logIdx = 0;
volatile bool     logArmed = false;
volatile uint32_t logFirstUs = 0;

void IRAM_ATTR onLogEdge(){
    if(!logArmed || logIdx>=LOG_MAXEDGES) return;
    uint32_t t=micros();
    if(logIdx==0) logFirstUs=t;
    logT[logIdx]=t;
    logL[logIdx]=(uint8_t)digitalRead(PIN_LOG);
    logIdx++;
}

void logDump(){
    logArmed=false;
    detachInterrupt(PIN_LOG);
    if(!logIdx){ Serial.println("[log] no edges captured."); return; }
    uint32_t base=logT[0];
    Serial.println("---RAW BEGIN---");
    Serial.flush();
    Serial.println("idx,t_us,level,dt_us");
    for(uint32_t i=0;i<logIdx;i++){
        Serial.printf("%lu,%lu,%u,%lu\n",(unsigned long)i,
            (unsigned long)(logT[i]-base),logL[i],
            (unsigned long)(i?logT[i]-logT[i-1]:0));
        if((i & 0x1F)==0){ Serial.flush(); delay(2); }
    }
    Serial.flush();
    Serial.printf("---RAW END--- %lu edges\n",(unsigned long)logIdx);
    Serial.println("===CAPTURE DONE===");
    Serial.flush();
}

void logArm(){
    if(running) stopRun();
    logIdx=0; logFirstUs=0; logArmed=true;
    pinMode(PIN_LOG, INPUT);
    attachInterrupt(PIN_LOG, onLogEdge, CHANGE);
    Serial.println("[log] ARMED on GPIO6.");
}

// ---- buttons ----
unsigned long lastB1=0, lastB2=0;
constexpr unsigned long DEBOUNCE_MS=200;
int prevB1=HIGH, prevB2=HIGH;

void btnOnOff(){ if(running) stopRun(); else startPlayback(); }
void btnPower(){
    runIdx=(runIdx+1)%RUN_COUNT;
    curRunDuty=RUN_STEPS[runIdx];
    if(running){ setDuty(curRunDuty); }
    Serial.printf("[BTN2] run power -> %d%%%s\n", curRunDuty, running?" (live)":" (set; BTN1 to run)");
}
void pollButtons(){
    int b1=digitalRead(PIN_BTN_ONOFF), b2=digitalRead(PIN_BTN_POWER);
    unsigned long now=millis();
    if(prevB1==HIGH && b1==LOW && now-lastB1>DEBOUNCE_MS){ lastB1=now; btnOnOff(); }
    if(prevB2==HIGH && b2==LOW && now-lastB2>DEBOUNCE_MS){ lastB2=now; btnPower(); }
    prevB1=b1; prevB2=b2;
}

// ---- handle command ----
void handle(String c){
    c.trim(); if(!c.length()) return;
    String lc=c; lc.toLowerCase();
    if(lc=="?"||lc=="help"){
        Serial.println(F("on off | play | pwarm <ms> | pulse <ms> | p<10-75> | f<hz>"));
        Serial.println(F("tmo <ms> | force | nostatus"));
        Serial.println(F("statusinfo | log logdump | zc status"));
        Serial.println(F("play = CLOSED-LOOP: 222Hz startup duty -> watch 110Hz status -> run duty."));
        Serial.println(F("Cap 75% on p<>; play bypasses cap (uses recorded ticks). 'pulse 500' bounded."));
    }
    else if(lc=="on"){ startRun(); }
    else if(lc=="off"){ stopRun(); }
    else if(lc=="play"){ startPlayback(); }
    else if(lc.startsWith("pwarm")){
        int sp = c.indexOf(' ');
        if(sp>0){
            long m = c.substring(sp+1).toInt();
            if(m>=500 && m<=20000){ pbWarmupMs=m;
                Serial.printf("[pwarm] playback warmup hold = %lums\n",(unsigned long)pbWarmupMs); }
            else Serial.println("[pwarm] usage: pwarm <500..20000>");
        } else Serial.printf("[pwarm] current=%lums\n",(unsigned long)pbWarmupMs);
    }
    else if(lc.startsWith("pulse")){
        long ms = c.substring(5).toInt();
        if(ms <= 0){ Serial.println("[PULSE] usage: pulse <ms>  e.g. 'pulse 500'"); }
        else { pulseRun((uint32_t)ms); }
    }
    else if(lc.startsWith("tmo")){
        int sp = c.indexOf(' ');
        if(sp>0){
            long m = c.substring(sp+1).toInt();
            if(m>=500 && m<=30000){ statusTimeoutMs=m;
                Serial.printf("[tmo] %lums\n",(unsigned long)statusTimeoutMs); }
            else Serial.println("[tmo] usage: tmo <500..30000>");
        } else Serial.printf("[tmo] current=%lums\n",(unsigned long)statusTimeoutMs);
    }
    else if(lc=="force"){ forceMode = !forceMode;
        Serial.printf("[force] %s (open-loop, no status gate)\n",
            forceMode?"ENABLED — DANGEROUS":"disabled"); }
    else if(lc=="nostatus"){ statusBypass = !statusBypass;
        Serial.printf("[nostatus] %s\n", statusBypass?"ENABLED (debug)":"disabled"); }
    else if(lc=="statusinfo"){
        // Quick live readout: count edges over 200ms now
        uint32_t before = statusEdgeCount;
        delay(200);
        uint32_t edges = statusEdgeCount - before;
        Serial.printf("[statusinfo] %lu edges in 200ms (~%.1fHz). %s threshold (%lu)\n",
            (unsigned long)edges, edges*2.5,
            edges >= STATUS_EDGES_MIN ? ">=" : "<",
            (unsigned long)STATUS_EDGES_MIN);
        Serial.printf("[statusinfo] PIN_STATUS instantaneous: %d\n", digitalRead(PIN_STATUS));
    }
    else if(lc=="log"){ logArm(); }
    else if(lc=="logdump"){ logDump(); }
    else if(lc=="status"){
        Serial.printf("[status] run=%d duty=%d%% freq=%luHz tmo=%lums force=%d nostatus=%d\n",
            running, curDuty, (unsigned long)cmdFreqHz,
            (unsigned long)statusTimeoutMs,
            forceMode, statusBypass);
    }
    else if(lc=="zc"){
        Serial.printf("[zc] period=%luus ~%.1fHz (%s)\n",
            (unsigned long)zcPeriodUs,
            zcPeriodUs?1000000.0/zcPeriodUs:0.0,
            zcSeen?"live":"none");
    }
    else if(lc.startsWith("p")){
        int d=c.substring(1).toInt();
        if(d > DUTY_MAX){
            Serial.printf("[p] %d > %d REJECTED (VK3HZ P100 = %d%%, >cap over-drives)\n", d, DUTY_MAX, DUTY_MAX);
        } else {
            curRunDuty=d; setDuty(d);
            Serial.printf("[p] run duty=%d%%\n",curDuty);
        }
    }
    else if(lc.startsWith("f")){
        long h=c.substring(1).toInt();
        if(h>0){cmdFreqHz=h; if(running)timerStart(h);
            Serial.printf("[f]%luHz\n",(unsigned long)cmdFreqHz);}
    }
    else Serial.println("? (try ?)");
}

// ============================================================================
//  WiFi AP web UI  —  adjustable params + live feedback, PWM unaffected
// ============================================================================
const char PAGE[] PROGMEM = R"HTML(
<!doctype html><html><head><meta name=viewport content="width=device-width,initial-scale=1">
<title>Termite RF</title><style>
body{font-family:system-ui,sans-serif;background:#111;color:#eee;margin:0;padding:14px}
h2{margin:.2em 0}.card{background:#1c1c1c;border:1px solid #333;border-radius:10px;padding:12px;margin:10px 0}
.row{display:flex;justify-content:space-between;align-items:center;margin:6px 0}
input[type=number]{width:90px;background:#222;color:#eee;border:1px solid #444;border-radius:6px;padding:6px}
button{font-size:1.05em;border:0;border-radius:10px;padding:14px;margin:4px 0;width:100%;color:#fff;cursor:pointer}
.play{background:#1f7a3f}.stop{background:#a11;font-size:1.4em;padding:20px}.apply{background:#2563a8}
.k{color:#9af}.v{font-weight:600}.big{font-size:1.3em}
label{display:flex;justify-content:space-between;align-items:center;margin:6px 0}
small{color:#888}
</style></head><body>
<h2>Termite RF — inverter control</h2>
<div class=card>
 <div class=row><span class=k>State</span><span class="v big" id=mode>—</span></div>
 <div class=row><span class=k>Duty</span><span class=v id=duty>—</span></div>
 <div class=row><span class=k>Freq</span><span class=v id=freq>—</span></div>
 <div class=row><span class=k>Status 110Hz</span><span class=v id=shz>—</span></div>
 <div class=row><span class=k>Run time</span><span class=v id=rt>—</span></div>
</div>
<button class=play onclick="go('/play')">PLAY  (warmup &rarr; run)</button>
<button class=stop onclick="go('/off')">STOP</button>
<div class=card>
 <h3>Adjust</h3>
 <label>Freq (Hz)<input type=number id=i_freq step=0.1></label>
 <label>Startup duty %<input type=number id=i_warm step=0.1></label>
 <label>Run duty %<input type=number id=i_run step=0.1></label>
 <label>Attempt window (ms)<input type=number id=i_wms step=100></label>
 <label>Dead-man auto-off<input type=checkbox id=i_dm></label>
 <label>Dead-man (s)<input type=number id=i_dms></label>
 <label>Max run (s)<input type=number id=i_mr></label>
 <button class=apply onclick="apply()">Apply</button>
 <small>Startup duty held until 110Hz status seen, then Run duty. 230V: ~33%/75%. 120V: higher (~50%/85%). Watch "Status 110Hz" for strike.</small>
</div>
<script>
function go(u){fetch(u).then(refresh)}
function apply(){
 let q='/set?freq='+v('i_freq')+'&warm='+v('i_warm')+'&run='+v('i_run')
  +'&warmms='+v('i_wms')+'&deadman='+(document.getElementById('i_dm').checked?1:0)
  +'&dmsec='+v('i_dms')+'&maxrun='+v('i_mr');
 fetch(q).then(refresh);
}
function v(id){return document.getElementById(id).value}
function refresh(){fetch('/state').then(r=>r.json()).then(s=>{
 mode.textContent=s.mode.toUpperCase(); mode.style.color=s.run?'#5d5':'#888';
 duty.textContent=s.duty+' %'; freq.textContent=s.freq+' Hz';
 shz.textContent=s.shz+' Hz '+(s.spresent?'PRESENT':'absent');
 rt.textContent=s.run?(s.rt+' s'):'—';
 if(document.activeElement.tagName!='INPUT'){
  i_freq.value=s.freq;i_warm.value=s.warm;i_run.value=s.runp;i_wms.value=s.wms;
  i_dm.checked=s.dm;i_dms.value=s.dms;i_mr.value=s.mr;}
})}
setInterval(refresh,1000); refresh();
</script></body></html>
)HTML";

const char* modeStr(){
    if(!running) return "idle";
    switch(seqState){
      case SEQ_STARTUP: return "startup";
      case SEQ_RESTART: return "restart";
      case SEQ_RUN:     return "run";
      case SEQ_HOLD:    return "hold";
      default: break;
    }
    if(forceMode) return "force";
    return "run";
}

void handleRoot(){ server.send_P(200,"text/html",PAGE); }

void handleState(){
    lastWebContactMs = millis();                       // keep-alive
    uint32_t rt = running ? (millis()-runStartMs)/1000 : 0;
    bool spresent = statusPresent();                   // 110Hz band (60-170Hz)
    char j[420];
    snprintf(j,sizeof(j),
      "{\"run\":%d,\"mode\":\"%s\",\"duty\":%d,\"freq\":%.1f,"
      "\"warm\":%.1f,\"runp\":%.1f,\"wms\":%lu,\"shz\":%.1f,\"spresent\":%d,"
      "\"rt\":%lu,\"dm\":%d,\"dms\":%lu,\"mr\":%lu}",
      running?1:0, modeStr(), curDuty, pbFreqHz,
      pbWarmPct, pbRunPct, (unsigned long)pbWarmupMs,
      statusHzX10/10.0, spresent?1:0,
      (unsigned long)rt, deadmanOn?1:0,(unsigned long)deadmanSec,(unsigned long)maxRunSec);
    server.send(200,"application/json",j);
}

void handleSet(){
    if(server.hasArg("freq"))   pbFreqHz   = server.arg("freq").toFloat();
    if(server.hasArg("warm"))   pbWarmPct  = server.arg("warm").toFloat();
    if(server.hasArg("run"))    pbRunPct   = server.arg("run").toFloat();
    if(server.hasArg("warmms")){ long m=server.arg("warmms").toInt(); if(m>=0&&m<=20000) pbWarmupMs=m; }
    if(server.hasArg("deadman")) deadmanOn = server.arg("deadman").toInt()!=0;
    if(server.hasArg("dmsec")){ long s=server.arg("dmsec").toInt(); if(s>=3&&s<=120) deadmanSec=s; }
    if(server.hasArg("maxrun")){ long s=server.arg("maxrun").toInt(); if(s>=3&&s<=600) maxRunSec=s; }
    // live-apply duty if a playback is already running
    if(playbackActive){ sinkTicks = pbTicks(pbInRun?pbRunPct:pbWarmPct); curDuty=(int)lroundf(pbInRun?pbRunPct:pbWarmPct); }
    Serial.printf("[SET] freq=%.1f warm=%.1f run=%.1f wms=%lu dm=%d dms=%lu maxrun=%lu\n",
        pbFreqHz,pbWarmPct,pbRunPct,(unsigned long)pbWarmupMs,deadmanOn?1:0,
        (unsigned long)deadmanSec,(unsigned long)maxRunSec);
    server.send(200,"text/plain","ok");
}

void setupWeb(){
    WiFi.mode(WIFI_AP);
    WiFi.softAP(AP_SSID, AP_PASS);
    server.on("/", handleRoot);
    server.on("/state", handleState);
    server.on("/set", handleSet);
    server.on("/play", [](){ startPlayback(); webControlled=true; runStartMs=millis();
                             lastWebContactMs=millis(); server.send(200,"text/plain","ok"); });
    server.on("/off",  [](){ stopRun(); server.send(200,"text/plain","ok"); });
    server.begin();
    Serial.printf("[WiFi] AP '%s' (pass '%s')  ->  http://192.168.4.1/\n", AP_SSID, AP_PASS);
}

// safety + status-rate sampling, called from loop()
void webTick(){
    server.handleClient();
    // sample status edge rate every 500ms -> Hz (110Hz/50% = 220 edges/s)
    static uint32_t lastS=0, lastEdges=0;
    uint32_t now=millis();
    if(now-lastS>=500){
        uint32_t e=statusEdgeCount; uint32_t d=e-lastEdges; lastEdges=e;
        float hz = (d/ (float)(now-lastS) *1000.0f)/2.0f;   // edges/s /2 = Hz
        statusHzX10 = (uint32_t)lroundf(hz*10.0f);
        lastS=now;
    }
    // safety auto-off (web-initiated runs only; attended serial/button runs unaffected)
    if(running && webControlled){
        if(maxRunSec>0 && (now-runStartMs) > maxRunSec*1000UL){
            stopRun(); Serial.println("[SAFE] max-run reached -> OFF"); }
        else if(deadmanOn && (now-lastWebContactMs) > deadmanSec*1000UL){
            stopRun(); Serial.println("[SAFE] deadman: lost web contact -> OFF"); }
    }
}

