mmercalde/termite-rf-gun/panasonic_dual_igbt_esp32s3/panasonic_dual_igbt_esp32s3.ino
void setup(){
    Serial.begin(115200);
    pinMode(PIN_PWM, OUTPUT); digitalWrite(PIN_PWM, LOW);
    GPIO.out_w1tc=(1u<<PIN_PWM);

    // PIN_STATUS read-only. Plain INPUT — the external 10k/10k divider sets the
    // level. Status line IDLES HIGH (~5V->~2.5V) from power-on and starts TOGGLING
    // at 110Hz when the magnetron draws current; we detect the toggling (edges),
    // not a level. (Divider MUST be connected or this floats.)
    pinMode(PIN_STATUS, INPUT);
    attachInterrupt(PIN_STATUS, onStatusEdge, CHANGE);

    cmdOff();
    pinMode(PIN_ZC, INPUT);
    attachInterrupt(PIN_ZC, onZeroCross, RISING);
    pinMode(PIN_BTN_ONOFF, INPUT_PULLUP);
    pinMode(PIN_BTN_POWER, INPUT_PULLUP);
    cmdFreqHz=FREQ_LIST[freqIdx]; curRunDuty=RUN_STEPS[runIdx]; setDuty(curRunDuty);
    delay(200);
    Serial.println("\n===============================================");
    Serial.println(" Panasonic 2-IGBT inverter driver (F6645M family, 240V)");
    Serial.println(" VERIFIED: drive run duty from cycle one -> wait 110Hz status -> run");
    Serial.printf ( " Run: %d%% / TMO: %lums / Freq: %luHz (no soft-start)\n",
        curRunDuty,
        (unsigned long)statusTimeoutMs, (unsigned long)cmdFreqHz);
    Serial.println(" GPIO4->YELLOW(cmd)  GPIO5<-ORANGE(status,via divider)  GND->BROWN");
    Serial.println(" REQUIRED for status read: 1k series + ~1k pulldown on GPIO5");
    Serial.println(" 'on' or 'pulse 500'. 'force' = open-loop (proven single-IGBT path).");
    Serial.println("===============================================");
#if BOOT_AUTOLOG
    delay(500);
    Serial.println("[AUTOLOG] capture build. cat /dev/ttyACM0 > run.txt");
    logArm();
#endif
    setupWeb();   // AP 'TermiteRF' / http://192.168.4.1/ — untethered control
}

void loop(){
    while(Serial.available()){
        char ch=(char)Serial.read();
        if(ch=='\n'||ch=='\r'){ if(buf.length()){handle(buf);buf="";} }
        else if(buf.length()<32) buf+=ch;
    }
    pollButtons();
    seqTick();    // closed-loop startup state machine (startup->status->run, w/ retry)
    if(logArmed && logIdx>=LOG_MAXEDGES){ Serial.println("[log] buffer full."); logDump(); }
    if(logArmed && logIdx>0 && (micros()-logFirstUs) > LOG_WINDOW_MS*1000UL){
        Serial.println("[log] window elapsed."); logDump();
    }
    webTick();        // serve web UI + status-rate sampling + safety auto-off
    delay(2);
}
